BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
#include <Arduino.h>
//#include <string.h>
#include <time.h>

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>

#include <datalogger_config.h>  //Configuration parameters.

#include <Hash.h>
#include <WebServerFiles.cpp>

#include <FS.h>           //SPIFFS libraries.
#include <rtc_memory.hpp>
#include <statemachine.hpp>


//----------------------------------------------------------------------------------------
DHT dht22_sensor_1(DHT_SENSOR_1_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_2(DHT_SENSOR_2_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_3(DHT_SENSOR_3_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_4(DHT_SENSOR_4_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object

//---------------------------------------------------------------------------------------------------------------------
//Initialization functions.
void portInit(void);
uint8_t getBatteryLevel(void);           //Get battery level percentage (0 to 100%).
void setBatteryState(uint8 state=ON);     //Connects or disconnects battery.
void setSensorPower(unsigned char state);
void wifiTurnOn(void);
void wifiTurnOff(void);
void goDeepSleep(uint64_t time);
bool isCharging(void);
bool reedSwitchIsPressed(void);

void* stringToArray(std::string origin_string);
int32_t generateMeasurementValue(unsigned char type, float value);
String formatMeasurementValue(unsigned char type, float value);  //Converts measurements into valid format
uint32_t getServerTimeUnix(void);

bool writeDataToFlash(String path, void* data, unsigned int bytes);
bool readDataFromFlash(String path, uint32_t index, void* data, unsigned int bytes);
bool archiveWrite(void* data, uint16_t bytes);
bool archiveRead(uint32_t start_index, uint32_t end_index);
uint32_t archiveGetPointer(void);
//Functions to handle 
void handleHome(void);
void handleChangeNetworkConfig(void);
void handleChangeServerConfig(void);
unsigned char runWebServer(void);
unsigned char handleFormatRam(void);
unsigned char handleFormatFlash(void);
//---------------------------------------------------------------------------------------------------------------------

ESP8266WiFiMulti WiFiMulti;             //Wifi client side handle.
ESP8266WebServer server(8080);          //Server for configuration.
StateMachine statem(STATE_WAKE);  //Create StateMachine class object. Starts at wake.
RtcMemory rtcmem;                       //Object to handle rtc memory.


void setup() {
  portInit();
  wifiTurnOff();
  Serial.begin(115200);
  
  
  SPIFFS.begin();

  // handleFormatFlash();  //FOR TESTING ONLY!
  // handleFormatRam();

//////////////////////////////////////////////////////////////

/* 
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  setSensorPower(ON);
  delay(1000);
  //GET MEASUREMENTS
  for (unsigned char i = 0; i<4 ; i++){
    Serial.printf("\nTemperature_%d: %f\n", i+1, temperature_float[i] );
    Serial.printf("Humidity_%d: %f\n", i+1,humidity_float[i] );
  } 
  setSensorPower(OFF);
*/  

 
  
/*   // DEBUG: Write arbitrary data to  RTC memory.
      //Get measurements...
    Measurement m;    
    m.timestamp=1234567890+millis(); //Put current timestamp
    m.id_sensor[0]=1;   
    m.id_sensor[1]=2; 
    m.id_sensor[2]=3; 
    m.id_sensor[3]=4;
    m.temperature[0]=190; 
    m.temperature[1]=195;
    m.temperature[2]=195;
    m.temperature[3]=192;
    m.humidity[0]=56; 
    m.humidity[1]=54; 
    m.humidity[2]=54; 
    m.humidity[3]=52;  */
    
  //   //Save measurements into temporary memory.
  //   if ( ! rtcmem.saveMeasurements(&m, sizeof(m))) //If data is not saved correctly in RAM...
  //   {
  //     Serial.printf(" \n -------- RTC memory full. Saving data to flash and clearing memory... --------");
  //     /* save to flash, clear RAM and then rewrite to it */
      
  //     uint8 buf[(RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4];   //Temporary buffer to read measurements
  //     rtcmem.readData(RTC_MEMORY_MEASUREMENTS_START_BLOCK, &buf, (RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4);

  //     // writeDataToFlash(MEASUREMENTS_FILE_NAME, buf, sizeof(buf)); //Save measurements to flash.
  //     archiveWrite(buf, sizeof(buf));
  //     rtcmem.clearMeasurements();   //Clears rtc memory.

  //     m.timestamp=millis();   //Put actual time for the moment the pending to store measurement is stored.
  //     rtcmem.saveMeasurements(&m, sizeof(m));   //Saves current measurement.
  
  //   }

  
  
  

}


void loop() {

  //Make method to detect if power was disconnected (to automatically call method
  // recoverVariables() and initialize rtc memory properly.)
  
  if(statem.getState() == STATE_WAKE){
    
    if(statem.stateInit()){ //State initialization.
       Serial.printf("\n --- State: %d ---", statem.getState());
      
      //Checks if device has lost power supply.
      if(rtcmem.checkPowerdown()){
        Serial.print("\nDevice has lost power supply");
        if(rtcmem.initialize())  //Recovers variables
          Serial.print("\nRTC memory recovered correctly.");
        else  
        Serial.print("\n RTC memory recovery failed.");
      }
      
      Serial.printf("\n system_get_time() = %d", system_get_time());
      Serial.printf("\n system_get_rtc_time = %d", system_get_rtc_time());
      delay(1000);

      

      if(digitalRead(REED_SWITCH_PIN)){ //Si el reed switch está activado...
        /*
            To solve: When waking up from switch (not RTC interrupt), the time will unsincronize
            as the device will go deep sleep from another full hour after that.

            This affects only when the switch being pressed is not detected -> put capacitor to hold
            the signal the time needed to boot.

            A more effective way would be to get the actual value of RTC counter (in milliseconds) and compare
            if it has reach the "timer module" -> if it does, this means the wake up was made by the timer and
            not from the switch.
        */

       
        if(isCharging()){   //If charger is connected...
          delay(5000);
          if(digitalRead(REED_SWITCH_PIN)){  //If it is still pressed...
            
            statem.setState(STATE_CONFIGURATION); //Go to configuration mode.
          }
          else
            statem.setState(STATE_GET_MEASUREMENTS);
        }
        else
        {
          statem.setState(STATE_GET_MEASUREMENTS);
        }
        
        
